[
  {
    "id": "sokkie-basic-spin",
    "name": "Basic Spin",
    "danceType": "Sokkie",
    "difficulty": "Beginner",
    "category": "Turns",
    "description": "A simple, smooth single spin where the leader raises the follower’s hand to guide a controlled turn while maintaining forward momentum. One of the most common and essential turns in Sokkie.",
    "media": "https://media4.giphy.com/media/v1.Y2lkPTc5MGI3NjExdmV3cHZvNWM5aWhuNDlwdG8yaWpvMnhtbTBxOGlmY21qNnUzYnczOSZlcD12MV9pbnRlcm5hbF9naWZfYnlfaWQmY3Q9Zw/dZElRZ9vwsKIhbg2Zj/giphy.mp4",  
    "tips": "Leaders: lift the hand just enough for clearance and keep the turn gentle. Followers: keep your core engaged and finish the spin facing your partner."
  },
  {
    "id": "sokkie-cuddle",
    "name": "Cuddle Position Turn",
    "danceType": "Sokkie",
    "difficulty": "Beginner",
    "category": "Basics",
    "description": "Leader guides the follower into a wrapped 'cuddle' position before unwinding back to open position.",
    "media": "https://media2.giphy.com/media/v1.Y2lkPTc5MGI3NjExd3F1djF0eXo1c3VwbjE3MTc0am5pMmc4YWIwbWtmYWgyNTZvbDQ3cCZlcD12MV9pbnRlcm5hbF9naWZfYnlfaWQmY3Q9Zw/Mag8exximx9jij41oB/giphy.mp4",  
    "tips": "Maintain gentle frame and don’t over-rotate the wrap; keep it relaxed and controlled."
  },
  {
    "id": "sokkie-tornado",
    "name": "Tornado",
    "danceType": "Sokkie",
    "difficulty": "Intermediate",
    "category": "Turns",
    "description": "A fast rotational move where the leader guides the follower into a tight series of spins while maintaining smooth travelling momentum. Common in energetic Sokkie socials and used to add flair during quick songs.",
    "media": "https://res.cloudinary.com/ddrwt3rgn/video/upload/v1763248246/tornado_k509ke.mp4",
    "tips": "Keep your travelling line steady and frame relaxed. Leaders should signal early; followers should keep steps small to stay balanced during the spin."
},{
    "id": "sokkie-drop-dip",
    "name": "Drop Dip with Turning Exit",
    "danceType": "Sokkie",
    "difficulty": "Advanced",
    "category": "Dips",
    "description": "A dramatic dip where the leader switches hand connection before lowering the follower close to the floor. The follower extends one leg for style while maintaining a strong core. The leader lifts the follower smoothly back to standing and transitions into a turning exit. Used as a highlight movement in fast-paced or show-style Sokkie.",
    "media": "https://media0.giphy.com/media/v1.Y2lkPTc5MGI3NjExZGJudXlxZnhwd2YwYzcxd3lqaXEwZTk5M2VqeHg5YnlpOTIzdDd0cSZlcD12MV9pbnRlcm5hbF9naWZfYnlfaWQmY3Q9Zw/l0HUj5XzO0sITClJ6/giphy.mp4",
    "tips": "Leaders: keep your stance wide and lift with your legs, not your back. Followers: engage your core, control the leg extension, and keep your frame light during the lift and turn."
}
]